; domain
(define (domain kitchen-line)
  (:requirements :strips :typing)
  (:types chef recipe utensil garnish)
  (:predicates
  (carries ?i - utensil ?s - chef)
  (prepares ?i - utensil ?m - garnish)
  (focused_on ?s - chef ?d - recipe)
  (energy_spare ?s - chef)
  (energy_active ?i - utensil)
  (sharpened ?i - utensil)
  (have_dish ?d - recipe ?m - garnish)
  (sharpening_recipe ?i - utensil ?d - recipe))

  (:action switch_focus
   :parameters (?s - chef ?d_new - recipe ?d_prev - recipe)
   :precondition (and (focused_on ?s ?d_prev))
   :effect (and  (focused_on ?s ?d_new)
                 (not (focused_on ?s ?d_prev))))

  (:action fire_up
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_spare ?s))
   :effect (and (energy_active ?i)
                (not (sharpened ?i))
                (not (energy_spare ?s))))

  (:action cool_down
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_active ?i))
   :effect (and (not (energy_active ?i))
                (energy_spare ?s)))

  (:action sharpen
   :parameters (?s - chef ?i - utensil ?d - recipe)
   :precondition (and (carries ?i ?s)
          (sharpening_recipe ?i ?d)
                      (focused_on ?s ?d)
                      (energy_active ?i))
   :effect (sharpened ?i))

  (:action plate_dish
   :parameters (?s - chef ?d - recipe ?i - utensil ?m - garnish)
   :precondition (and (sharpened ?i)
                      (carries ?i ?s)
                      (prepares ?i ?m)
                      (energy_active ?i)
                      (focused_on ?s ?d))
   :effect (have_dish ?d ?m)))

; problem
(define (problem kitchen-line-p04)
(:domain kitchen-line)
(:objects
	chef0 - chef
	utensil0 - utensil
	utensil1 - utensil
	utensil2 - utensil
	chef1 - chef
	utensil3 - utensil
	chef2 - chef
	utensil4 - utensil
	utensil5 - utensil
	griddle0 - garnish
	plating1 - garnish
	entree1 - recipe
	entree2 - recipe
	pantry0 - recipe
	dessert3 - recipe
	dessert4 - recipe
	dessert5 - recipe
	appetiser6 - recipe
	entree7 - recipe
)
(:init
	(prepares utensil0 plating1)
	(prepares utensil0 griddle0)
	(sharpening_recipe utensil0 entree2)
	(prepares utensil1 plating1)
	(sharpening_recipe utensil1 entree1)
	(prepares utensil2 plating1)
	(sharpening_recipe utensil2 entree2)
	(carries utensil0 chef0)
	(carries utensil1 chef0)
	(carries utensil2 chef0)
	(energy_spare chef0)
	(focused_on chef0 appetiser6)
	(prepares utensil3 griddle0)
	(sharpening_recipe utensil3 entree2)
	(carries utensil3 chef1)
	(energy_spare chef1)
	(focused_on chef1 pantry0)
	(prepares utensil4 plating1)
	(sharpening_recipe utensil4 pantry0)
	(prepares utensil5 plating1)
	(sharpening_recipe utensil5 pantry0)
	(carries utensil4 chef2)
	(carries utensil5 chef2)
	(energy_spare chef2)
	(focused_on chef2 dessert4)
)
(:goal (and
	(focused_on chef1 dessert5)
	(focused_on chef2 dessert4)
	(have_dish dessert3 griddle0)
	(have_dish dessert4 griddle0)
	(have_dish dessert5 griddle0)
	(have_dish appetiser6 griddle0)
	(have_dish entree7 plating1)
))

)

; plan
1. (fire_up utensil4 chef2)
   deleted: (energy_spare chef2)
   added: (energy_active utensil4)
   goals met: 1 of 7
2. (fire_up utensil0 chef0)
   deleted: (energy_spare chef0)
   added: (energy_active utensil0)
   goals met: 1 of 7
3. (switch_focus chef1 dessert5 pantry0)
   deleted: (focused_on chef1 pantry0)
   added: (focused_on chef1 dessert5)
   goals met: 2 of 7
4. (switch_focus chef0 entree2 appetiser6)
   deleted: (focused_on chef0 appetiser6)
   added: (focused_on chef0 entree2)
   goals met: 2 of 7
5. (sharpen chef0 utensil0 entree2)
   added: (sharpened utensil0)
   goals met: 2 of 7
6. (switch_focus chef0 appetiser6 entree2)
   deleted: (focused_on chef0 entree2)
   added: (focused_on chef0 appetiser6)
   goals met: 2 of 7
7. (plate_dish chef0 appetiser6 utensil0 griddle0)
   added: (have_dish appetiser6 griddle0)
   goals met: 3 of 7
8. (switch_focus chef0 dessert3 appetiser6)
   deleted: (focused_on chef0 appetiser6)
   added: (focused_on chef0 dessert3)
   goals met: 3 of 7
9. (plate_dish chef0 dessert3 utensil0 griddle0)
   added: (have_dish dessert3 griddle0)
   goals met: 4 of 7
10. (switch_focus chef0 dessert4 dessert3)
   deleted: (focused_on chef0 dessert3)
   added: (focused_on chef0 dessert4)
   goals met: 4 of 7
11. (plate_dish chef0 dessert4 utensil0 griddle0)
   added: (have_dish dessert4 griddle0)
   goals met: 5 of 7
12. (switch_focus chef0 dessert5 dessert4)
   deleted: (focused_on chef0 dessert4)
   added: (focused_on chef0 dessert5)
   goals met: 5 of 7
13. (plate_dish chef0 dessert5 utensil0 griddle0)
   added: (have_dish dessert5 griddle0)
   goals met: 6 of 7
14. (switch_focus chef0 entree7 dessert5)
   deleted: (focused_on chef0 dessert5)
   added: (focused_on chef0 entree7)
   goals met: 6 of 7
15. (plate_dish chef0 entree7 utensil0 plating1)
   added: (have_dish entree7 plating1)
   goals met: 7 of 7
